# SetDeformedShapeSettings Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayStyle..::..SetDeformedShapeSettings Method
AnalysisDisplayStyle Class See Also
---
Set deformed shape settings object for the style.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void SetDeformedShapeSettings(
	AnalysisDisplayDeformedShapeSettings deformedShapeSettings
)
```

Visual Basic
---
```text
Public Sub SetDeformedShapeSettings ( _
	deformedShapeSettings As AnalysisDisplayDeformedShapeSettings _
)
```

Visual C++
---
```text
public:
void SetDeformedShapeSettings(
	AnalysisDisplayDeformedShapeSettings^ deformedShapeSettings
)
```

# ### Parameters
deformedShapeSettings
    Type: Autodesk.Revit.DB.Analysis..::..AnalysisDisplayDeformedShapeSettings
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Deformed shape settings were not created with the object. |

# See Also
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace